# Pandas

In [1]:
print("welcome")

welcome

In [2]:
import pandas as pd
import numpy as np
print("hi")

hi

## Series

In [3]:
my_data=[10,20,30]
labels=['a','b','c']
dict={'a':10,'b':20,'c':30}
arr=np.array(my_data)

In [4]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [8]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [9]:
pd.Series(dict)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(dict,dict)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(labels,my_data)

10    a
20    b
30    c
dtype: object

In [12]:
pd.Series(labels,labels)

a    a
b    b
c    c
dtype: object

In [13]:
s=pd.Series([1,2,3,4],['A','B','C','D'])

In [14]:
s[3]

4

In [15]:
# s[1,3]

## Data frames

In [16]:
from numpy.random import randn

In [17]:
np.random.seed(101)

In [18]:
df0=pd.DataFrame(randn(4,4),['A','B','C','D'],['W','X','Y','Z'])

In [19]:
df0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [20]:
df0['V']=df0['W']-1

In [21]:
df0

          W         X         Y         Z         V
A  2.706850  0.628133  0.907969  0.503826  1.706850
B  0.651118 -0.319318 -0.848077  0.605965 -0.348882
C -2.018168  0.740122  0.528813 -0.589001 -3.018168
D  0.188695 -0.758872 -0.933237  0.955057 -0.811305

In [22]:
cols=list(df0.columns)
cols

['W', 'X', 'Y', 'Z', 'V']

In [23]:
df1=df0[[cols[4]]+cols[0:4]]                #reodering or cloumns

In [24]:
df1

          V         W         X         Y         Z
A  1.706850  2.706850  0.628133  0.907969  0.503826
B -0.348882  0.651118 -0.319318 -0.848077  0.605965
C -3.018168 -2.018168  0.740122  0.528813 -0.589001
D -0.811305  0.188695 -0.758872 -0.933237  0.955057

In [25]:
# r=list(df.row)

In [26]:
df0.index.values                              #to return index in the form of numpy array

array(['A', 'B', 'C', 'D'], dtype=object)

In [27]:
df0.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [28]:
rows=list(df0.index)                            #to get the list of indexes
rows

['A', 'B', 'C', 'D']

In [29]:
r=list(df0.index.values)
r

['A', 'B', 'C', 'D']

In [30]:
# df0[[rows[3]]+rows[0:3]]

In [31]:
type(cols)

list

In [32]:
type(rows)

list

In [33]:
df1.reindex(['D','C','B','A'])

          V         W         X         Y         Z
D -0.811305  0.188695 -0.758872 -0.933237  0.955057
C -3.018168 -2.018168  0.740122  0.528813 -0.589001
B -0.348882  0.651118 -0.319318 -0.848077  0.605965
A  1.706850  2.706850  0.628133  0.907969  0.503826

In [34]:
df0.reindex([3,2,1,0])

    W   X   Y   Z   V
3 NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN
0 NaN NaN NaN NaN NaN

In [35]:
rowindices=[3,2,1,0]                                      #reordering rows and cols using iloc
colindices=[4,0,1,2,3]
df2=df0.iloc[np.array(rowindices),np.array(colindices)]

In [36]:
df2

          V         W         X         Y         Z
D -0.811305  0.188695 -0.758872 -0.933237  0.955057
C -3.018168 -2.018168  0.740122  0.528813 -0.589001
B -0.348882  0.651118 -0.319318 -0.848077  0.605965
A  1.706850  2.706850  0.628133  0.907969  0.503826

In [37]:
df2['W']

D    0.188695
C   -2.018168
B    0.651118
A    2.706850
Name: W, dtype: float64

In [38]:
df2[0:2]

          V         W         X         Y         Z
D -0.811305  0.188695 -0.758872 -0.933237  0.955057
C -3.018168 -2.018168  0.740122  0.528813 -0.589001

In [39]:
df2.tail(2)

          V         W         X         Y         Z
B -0.348882  0.651118 -0.319318 -0.848077  0.605965
A  1.706850  2.706850  0.628133  0.907969  0.503826

In [40]:
df2.iloc[0:2]

          V         W         X         Y         Z
D -0.811305  0.188695 -0.758872 -0.933237  0.955057
C -3.018168 -2.018168  0.740122  0.528813 -0.589001

In [41]:
df2.iloc[0:2,0:2]

          V         W
D -0.811305  0.188695
C -3.018168 -2.018168

In [42]:
df2.iloc[1,0:2]

V   -3.018168
W   -2.018168
Name: C, dtype: float64

In [43]:
df2.iloc[0,0]

-0.8113046905507757

In [44]:
list(df2.iloc[1,0:2])

[-3.018168244037392, -2.018168244037392]

In [45]:

# c=list(df2.iloc[[1:2,1],[2:3,2]])
# c

In [46]:
df0.filter(regex='\d')

Empty DataFrame
Columns: []
Index: [A, B, C, D]

## Missing values

In [47]:
d={'A':[1,2,np.nan],'B':[4,5,6],'C':[np.nan,8,9]}

In [48]:
df=pd.DataFrame(d)

In [49]:
df

     A  B    C
0  1.0  4  NaN
1  2.0  5  8.0
2  NaN  6  9.0

In [50]:
df.dropna()   # operation along rows

     A  B    C
1  2.0  5  8.0

In [51]:
df.dropna(axis=1)     # operation along columns

   B
0  4
1  5
2  6

In [52]:
df.dropna(thresh=2)      #atleast 2 non NaN values should be there in order to not get dropped

     A  B    C
0  1.0  4  NaN
1  2.0  5  8.0
2  NaN  6  9.0

In [53]:
df.dropna(thresh=3)     #atleast 3 non NaN values should be there in order to not get dropped

     A  B    C
1  2.0  5  8.0

In [54]:
df.fillna(value=0)     #replacing missing values by 0

     A  B    C
0  1.0  4  0.0
1  2.0  5  8.0
2  0.0  6  9.0

In [55]:
df['A'].fillna(value=df['A'].mean())        #filling the missing place by the mean of that column

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [56]:
df['A'].fillna(value=3)

0    1.0
1    2.0
2    3.0
Name: A, dtype: float64

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       2 non-null      float64
 1   B       3 non-null      int64
 2   C       2 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 136.0 bytes

In [58]:
df

     A  B    C
0  1.0  4  NaN
1  2.0  5  8.0
2  NaN  6  9.0